; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	infrared0 - mode
	image1 - mode
	image2 - mode
	Star3 - direction
	Star4 - direction
	GroundStation2 - direction
	Star1 - direction
	GroundStation0 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image2)
	(supports instrument2 image1)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 image2)
	(supports instrument4 image1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star1)
	(supports instrument5 image2)
	(supports instrument5 infrared0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument6 image1)
	(supports instrument6 image2)
	(calibration_target instrument6 Star3)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet14)
	(supports instrument7 image1)
	(supports instrument7 image2)
	(calibration_target instrument7 Star1)
	(supports instrument8 infrared0)
	(supports instrument8 image1)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation0)
	(supports instrument9 image2)
	(supports instrument9 infrared0)
	(supports instrument9 image1)
	(calibration_target instrument9 Star4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star6)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation2)
	(supports instrument11 image1)
	(supports instrument11 infrared0)
	(calibration_target instrument11 Star1)
	(supports instrument12 image2)
	(calibration_target instrument12 GroundStation0)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon8)
)
(:goal (and
	(pointing satellite1 Phenomenon7)
	(have_image Planet5 image2)
	(have_image Star6 image1)
	(have_image Phenomenon7 infrared0)
	(have_image Phenomenon8 infrared0)
	(have_image Phenomenon9 infrared0)
	(have_image Planet10 image1)
	(have_image Star11 infrared0)
	(have_image Planet12 image1)
	(have_image Phenomenon13 image2)
	(have_image Planet14 image1)
))

)

; plan
1. (turn_to satellite1 star1 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star1)
   goals met: 0 of 11
2. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 11
3. (calibrate satellite1 instrument4 star1)
   added: (calibrated instrument4)
   goals met: 0 of 11
4. (turn_to satellite1 planet14 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet14)
   goals met: 0 of 11
5. (take_image satellite1 planet14 instrument4 image1)
   added: (have_image planet14 image1)
   goals met: 1 of 11
6. (turn_to satellite1 planet12 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet12)
   goals met: 1 of 11
7. (take_image satellite1 planet12 instrument4 image1)
   added: (have_image planet12 image1)
   goals met: 2 of 11
8. (turn_to satellite1 planet10 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet10)
   goals met: 2 of 11
9. (take_image satellite1 planet10 instrument4 image1)
   added: (have_image planet10 image1)
   goals met: 3 of 11
10. (turn_to satellite1 phenomenon9 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 11
11. (take_image satellite1 phenomenon9 instrument4 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 4 of 11
12. (turn_to satellite1 phenomenon8 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon8)
   goals met: 4 of 11
13. (take_image satellite1 phenomenon8 instrument4 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 5 of 11
14. (turn_to satellite1 phenomenon13 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon13)
   goals met: 5 of 11
15. (take_image satellite1 phenomenon13 instrument4 image2)
   added: (have_image phenomenon13 image2)
   goals met: 6 of 11
16. (turn_to satellite1 planet5 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet5)
   goals met: 6 of 11
17. (take_image satellite1 planet5 instrument4 image2)
   added: (have_image planet5 image2)
   goals met: 7 of 11
18. (turn_to satellite1 star11 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star11)
   goals met: 7 of 11
19. (take_image satellite1 star11 instrument4 infrared0)
   added: (have_image star11 infrared0)
   goals met: 8 of 11
20. (turn_to satellite1 star6 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star6)
   goals met: 8 of 11
21. (take_image satellite1 star6 instrument4 image1)
   added: (have_image star6 image1)
   goals met: 9 of 11
22. (turn_to satellite1 phenomenon7 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon7)
   goals met: 10 of 11
23. (take_image satellite1 phenomenon7 instrument4 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 11 of 11
